# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Thu Apr 16 13:24:48 EDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design fp16_multiplier_pipe

create_clock -name "clk" -period 3.0 -waveform {0.0 1.5} [get_ports clk]
set_clock_transition 0.05 [get_clocks clk]
set_load -pin_load 0.01 [get_ports out_valid]
set_load -pin_load 0.01 [get_ports {y[15]}]
set_load -pin_load 0.01 [get_ports {y[14]}]
set_load -pin_load 0.01 [get_ports {y[13]}]
set_load -pin_load 0.01 [get_ports {y[12]}]
set_load -pin_load 0.01 [get_ports {y[11]}]
set_load -pin_load 0.01 [get_ports {y[10]}]
set_load -pin_load 0.01 [get_ports {y[9]}]
set_load -pin_load 0.01 [get_ports {y[8]}]
set_load -pin_load 0.01 [get_ports {y[7]}]
set_load -pin_load 0.01 [get_ports {y[6]}]
set_load -pin_load 0.01 [get_ports {y[5]}]
set_load -pin_load 0.01 [get_ports {y[4]}]
set_load -pin_load 0.01 [get_ports {y[3]}]
set_load -pin_load 0.01 [get_ports {y[2]}]
set_load -pin_load 0.01 [get_ports {y[1]}]
set_load -pin_load 0.01 [get_ports {y[0]}]
group_path -weight 1.000000 -name cg_enable_group_clk -through [list \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E] ]
set_clock_gating_check -setup 0.5 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports in_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {b[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports out_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.46 [get_ports {y[0]}]
set_input_transition 0.1 [get_ports rst_n]
set_input_transition 0.1 [get_ports in_valid]
set_input_transition 0.1 [get_ports {a[15]}]
set_input_transition 0.1 [get_ports {a[14]}]
set_input_transition 0.1 [get_ports {a[13]}]
set_input_transition 0.1 [get_ports {a[12]}]
set_input_transition 0.1 [get_ports {a[11]}]
set_input_transition 0.1 [get_ports {a[10]}]
set_input_transition 0.1 [get_ports {a[9]}]
set_input_transition 0.1 [get_ports {a[8]}]
set_input_transition 0.1 [get_ports {a[7]}]
set_input_transition 0.1 [get_ports {a[6]}]
set_input_transition 0.1 [get_ports {a[5]}]
set_input_transition 0.1 [get_ports {a[4]}]
set_input_transition 0.1 [get_ports {a[3]}]
set_input_transition 0.1 [get_ports {a[2]}]
set_input_transition 0.1 [get_ports {a[1]}]
set_input_transition 0.1 [get_ports {a[0]}]
set_input_transition 0.1 [get_ports {b[15]}]
set_input_transition 0.1 [get_ports {b[14]}]
set_input_transition 0.1 [get_ports {b[13]}]
set_input_transition 0.1 [get_ports {b[12]}]
set_input_transition 0.1 [get_ports {b[11]}]
set_input_transition 0.1 [get_ports {b[10]}]
set_input_transition 0.1 [get_ports {b[9]}]
set_input_transition 0.1 [get_ports {b[8]}]
set_input_transition 0.1 [get_ports {b[7]}]
set_input_transition 0.1 [get_ports {b[6]}]
set_input_transition 0.1 [get_ports {b[5]}]
set_input_transition 0.1 [get_ports {b[4]}]
set_input_transition 0.1 [get_ports {b[3]}]
set_input_transition 0.1 [get_ports {b[2]}]
set_input_transition 0.1 [get_ports {b[1]}]
set_input_transition 0.1 [get_ports {b[0]}]
set_wire_load_mode "top"
